[
  {
    "title": "US Public Opinion on Hallyu and Implications for Korean Soft Power ...",
    "link": "https://keia.org/the-peninsula/us-public-opinion-on-hallyu-and-implications-for-korean-soft-power/",
    "snippet": "Feb 4, 2025 ... Hallyu (or Korean Wave) looks to continue its march onward in the Year of the Blue Snake. Netflix announced that the first five days of Squid Game Season 2 ...",
    "content": "202.464.1982\n1800 K Street NW\nTotal Index: 6660 publications.\nSign up for our mailing list to keep up to date on all the latest\n                                              developments.\nHallyu (or Korean Wave) looks to continue its march onward in the Year of the Blue Snake. Netflixannouncedthat the first five days ofSquid GameSeason 2 netted 68 million views, breaking the company’s previous first-week debut record set byWednesdayin 2022. Since its release on December 26, the show has already become Netflix’s seventh most popular non-English TV program behindSquid GameSeason 1, which currently has over 265 million views. Hallyu contents have had hints of success in the past, but the robustness of its rise across a broad spectrum of genres is a relatively recent phenomenon. What explains this trend? More importantly, why does it matter? Drawing on KEI’s annual survey data, an analysis of US public opinion data suggests that much of the interest in the United States is driven by the younger generation and that the recent rise of Hallyu should be taken seriously due to its significant impact on US attitudes about South Korea.\nWhy the Korean Wave Is Getting Bigger\nAmong the explanations for the continued success of Hallyu is theubiquityof digital and internet platforms, such as YouTube, OTT content players, and Spotify. These platforms provide multiple entry points for Korean content producers in the global market, which previously was managed by mega media outlets and PR firms. Gone are the days when music albumsneeded to go throughWestern marketing and scouting firms or producers. Now, Korean music artists can rise to global stardom byposting their contenton YouTube or having directors and producers work with Netflixto produce low-budget hitslike Squid Game. On the supply side of the equation, Korean entertainment agencies arestrategic and meticulousabout their approach to scouting, developing, and producing talent and content. The South Korean government’s continuingsupportfor various cultural exchange programs and events like KCON is another example.\nHallyu Consumer Profile\nAccording to the Korea Foundation and the ROK Ministry of Foreign Affairs, the number ofHallyu fansin 2023 was about 225 million, which was nearly a five-fold increase from 46 million in 2012. By region, Asia and Oceania accounted for 66 percent of fans and clubs, while the United States accounted for about 16.7 million fans. The ROK Ministry of Culture, Sports, and Tourism reported in 2020 that the main consumers of HallyuwereAsian women between the ages of 29 and 31.\nFigure 1. Determinants of Korean Pop Music, TV Programs, and Movie Consumption. (Logit Regression Coefficient Estimates with 95 Percent Confidence Limits)\n\n[*The coefficient estimates are hollow dots with horizontal lines indicating 95 percent confidence intervals. Income had following categories: 1 = Less than $10K; 2 = $10K-$19,999; 3 = $20K-$29,999; 4= $30K-$39,999; 5 = $40K-$49,999 ; 6 = $50K-$59,999; 7 = $60K-$69,999; 8 = $70K-$79,999; 9 = $80K-$99,999; 10 = $100K-$119,999; 11 = $120K-$149,999; 12 = $150K-$199,999; 13 = $200K-$249,999; 14 = $250K-$349,999; 15 = $350K-$499,999; 16 = $500K or more. All question wordings for corresponding variables can be found in Appendix I of the KEI Annual Survey Report from 2024.]\nLooking at KEI’s annual survey of the US public from 2024, we do not see evidence of any strong correlation between consumption of Hallyu content and gender, region, marital status, income, or education. However, there is a robust relationship between age and all content genres—the logit regression coefficients for age on various content modes are negative and more than two standard deviations away from zero (Figure 1). In other words, younger individuals tended to be consistently more interested in Korean television programs, popular music, and movies. There is also some evidence that suggests urbanicity, education, ideological orientation, and political leanings may also be associated with interest in Hallyu. For instance, individuals who were more educated, leaning liberal, and/or lived in or near metropolitan areas tended to be more interested in Korean TV, music, and movies.\nAttitudes about Hallyu and Korea’s Soft Power\nSo why does any of this matter? There is ample evidence suggesting that culture is one of the contributing factors to a country’s soft power. Joseph Nye, for instance,namesculture as one of the factors determining the extent to which a country can persuade or co-opt other countries to do what they otherwise would not. Impressions of Korea’s soft power and the contributing role of Korean cultural contentsuggestthat while culture is not the only factor, it can be a significant one.\nThe IMF’s recent effort to develop a Global Soft Power IndexshowsSouth Korea topping the list among 66 countries in 2020. Another studyshowsthat South Korea consistently performed among the top 10-15 percent of countries in terms of its soft power over the past five years.\nFigure 2. Factors that Impact US Public Perception of South Korea’s Favorability and Influence (Regression Coefficient Estimates with 95 Percent Confidence Limits)\n\n[* The coefficient estimates are hollow dotted with horizontal lines indicating 95 percent confidence intervals. Income had following categories: 1 = Less than $10K; 2 = $10K-$19,999; 3 = $20K-$29,999; 4= $30K-$39,999; 5 = $40K-$49,999 ; 6 = $50K-$59,999; 7 = $60K-$69,999; 8 = $70K-$79,999; 9 = $80K-$99,999; 10 = $100K-$119,999; 11 = $120K-$149,999; 12 = $150K-$199,999; 13 = $200K-$249,999; 14 = $250K-$349,999; 15 = $350K-$499,999; 16 = $500K or more. All question wordings for corresponding variables can be found in Appendix I of the KEI Annual Survey Report from 2024.]\nOne way to see whether these and other similar assessments of South Korea’s soft power are impacted by cultural content is to assess whether there is a positive association between consumption and affection for Hallyu and perceptions about favorability toward South Korea’s global influence. KEI data provides evidence in support of the view that cultural content contributes to South Korea’s soft power. After accounting for all demographic factors, familiarity or being a fan of Hallyu appears to have a significant impact on positive views about South Korea’s favorability and influence—the regression coefficients are positive and more than two standard deviations away from zero (Figure 2). Also, in keeping with the established wisdom, cultural factors account for anywhere between 5 to 9 percent of the total variance in US public attitudes about South Korea’s global influence and favorability—meaning, culture is only a part of that story.\nConclusion\nSouth Korean cultural content has been gaining traction globally, and its impact in the United States looks likely to grow in 2025 with more content in the pipeline. Rising interest and broadening fan bases have not only translated into record profits for the South Korean entertainment industry, but they have also elevated the country’s brand image on the international stage. This is especially meaningful in a year when the US-South Korea relationship can face challenges due to the demands of a new administration in Washington. If South Korea can work through its political and foreign policy challenges, Hallyu’s continuing march toward greater success can be a tailwind for South Korea’s ability to address this challenge.\n\nDr. Je Heon (James) Kim is the Director of Public Opinion and External Relations at the Korea Economic Institute of America (KEI). The views expressed here are the author’s alone.\nPhoto fromShutterstock.\nKEI is registered under the FARA as an agent of the Korea Institute for International Economic Policy, a public corporation established by the government of the Republic of Korea. Additional information is available at the Department of Justice, Washington, D.C.\n\nReturn to the Peninsula\n202.464.1982\n1800 K Street NW\nKEI is registered under the FARA as an agent of the KIEP, a public corporation established by the government of the Republic of Korea.Additional information is available at the U.S. Department of Justice, Washington, DC."
  },
  {
    "title": "Startup aims to get more public opinion fast and easy to Nebraska ...",
    "link": "https://nebraskaexaminer.com/2025/02/04/startup-aims-to-get-more-public-opinion-fast-and-easy-to-nebraska-lawmakers/",
    "snippet": "Feb 4, 2025 ... Elected officials, candidates, and civic groups essentially buy subscription space on the home page, which Nelson describes as resembling a Netflix menu.",
    "content": null
  },
  {
    "title": "Watch The Search For Instagram's Worst Con Artist | Netflix",
    "link": "https://www.netflix.com/title/81987249",
    "snippet": "2 days ago ... In world where social media can shape public opinion, this series explores how unscrupulous influencers can exploit misinformation for their own gain.",
    "content": "This short documentary series examines the true story of Belle Gibson, a social media influencer and wellness guru who built her fame on a web of lies.\nSocial media influencer Belle Gibson rises to fame and makes a fortune from her very public – but fake – battle with cancer.\nSpeaking for the first time on camera, Belle Gibson's brother and stepfather share their insights into the disgraced influencer's troubled childhood.\nQuestions? Call000-800-919-1743\nNetflix India"
  },
  {
    "title": "Public Opinion on The Perfect Match on Netflix Season 2 The ...",
    "link": "https://www.tiktok.com/discover/public-opinion-on-the-perfect-match-on-netflix-season-2-the-perfect-match",
    "snippet": "Feb 10, 2025 ... 84.6M posts. Discover videos related to Public Opinion on The Perfect Match on Netflix Season 2 The Perfect Match on TikTok. See more videos about Perfect ...",
    "content": null
  },
  {
    "title": "Your opinion about this film? it's available in netflix.",
    "link": "https://www.facebook.com/groups/NetflixBangers/posts/2492374657816314/",
    "snippet": "Jan 30, 2025 ... Netflix Bangers | Your opinion about this film. Public group. 󰞋. 3.2M Members · Anonymous participant profile picture. Anonymous participant ▻ Netflix Bangers.",
    "content": null
  },
  {
    "title": "When It Comes To Justin Baldoni vs. Blake Lively, It's Clear Who's ...",
    "link": "https://www.yahoo.com/entertainment/comes-justin-baldoni-vs-blake-041044478.html",
    "snippet": "Feb 4, 2025 ... It remains to be seen who is going to win in the court of law, but in the court of public opinion, it seems that Lively's ship is slowly sinking.",
    "content": "Opinion\nWhen It Comes To Justin Baldoni vs. Blake Lively, It's Clear Who's Winning In The Court Of Public Opinion\nKristin Myers\nWed, February 5, 2025 at 4:10 AM UTC\n8 min read\nUnless you've lived under a rock for the past few months, you've heard about\nJustin Baldoni\nand his lawsuit against his \"\nIt Ends With Us\n\" costar,\nBlake Lively\n.\nNot only was Baldoni her costar, but he was the director of the film, which put him in a position of power over the \"Gossip Girl\" alum. Lively has accused him of using this power to sexually harass and body shame her on set. Baldoni, on the other hand, has accused her of trying to wrestle creative control of the film away from him.\nSo who's right? Who's wrong? With lawsuits flying on both sides, it remains to be seen who is going to win in the court of law, but in the court of public opinion, it seems that Lively's ship is slowly sinking.\nWhy Blake Lively May Not Come Out On Top\nZUMAPRESS.com / MEGA\nThe #MeToo movement may no longer be in the spotlight as it once was, but that hasn't stopped women from being sexually harassed on movie sets. But is that really what happened here? Given the information that has come to light, it seems that Lively was uncomfortable on set and may have been justified in feeling that way. Without being there to witness things firsthand, it's hard for anyone to come to a conclusion about what really happened behind closed doors.\nAdvertisement\nAdvertisement\nAdvertisement\nA lot of people would say that, if she was so uncomfortable with Baldoni, she should have vocalized her concerns with him long before filming wrapped. And I agree with that. Is it fair to file a lawsuit after the movie has already finished? If she was harassed the way she claims, then yes, maybe, if she was afraid of some kind of retaliation, but the evidence that has emerged so far doesn't seem like a woman who was afraid to use her voice.\nBaldoni's team has leaked a treasure trove of information and even\nlaunched his own website\ntitled \"Lawsuit Info\" that shares alleged text messages that include himself, Lively, and her husband,\nRyan Reynolds\n. This situation has spiraled so out of control that even Lively's close friend, pop star\nTaylor Swift\n, has been dragged into the lawsuit. Ultimately, though, it looks like Lively is the one that put her there.\nDid Blake Lively Really Skip The Meeting With The Intimacy Coordinator?\nKCS Presse / MEGA\nWhen you’re going to film a romantic drama that deals with domestic violence, you need an intimacy coordinator on set. “It Ends With Us” had an intimacy coordinator, but according to Baldoni’s amended complaint listed on his website, Lively decided to skip the initial meeting where they outlined the sex scenes in the film and how they would play out on screen.\nAfter she “declined” the meeting, Baldoni claims that he was put in the \"less than ideal position of having to relay these notes to Lively in her penthouse\" and used terms like “goes down on her,” “orgasm,” and “foreplay.”\nAdvertisement\nAdvertisement\nAdvertisement\nHis lawyers claim that \"These notes would later become the basis for Lively’s complaint, in which she states that Baldoni would talk about his own sex life and insert gratuitous scenes with Lively’s character orgasming.\"\nAfter reading her lawsuit, it seems like this conversation was part of her harassment claim, but it's worth noting that Lively made some strange comments about working with an intimacy coordinator before. In an August 2024 interview with\nAccess Hollywood\n, Lively addressed some odd comments about being her own intimacy coordinator on set. “That shouldn’t be happening, by the way. I just want to be clear,” she said when asked what it was like “being the intimacy coordinator on some of those sexier scenes.”\n“You should not be the intimacy coordinator. You should definitely hire intimacy coordinators,” she added. “Which we did have, thank goodness.”\nThe interviewer then described a “sexy scene” where Lively was teaching Baldoni how to “pull” her in. When Lively asked where the interviewer saw the clip, it was actually author\nColleen Hoover\nwho jumped into the conversation and said she saw it herself on Instagram. Lively seemed uncomfortable as she tugged on the ends of her hair and stammered a bit as she continued the interview.\nDid Leaked Video Prove Blake Lively’s Claims Are Meritless?\nMEGA\nIn late January, behind-the-scenes footage of a romantic dancing scene surfaced online. The video, obtained by\nTMZ\n, shows them exchanging awkward banter while swaying back and forth. This scene is important because it was directly described in Lively as proof that Baldoni harassed her.\nAdvertisement\nAdvertisement\nAdvertisement\nAccording to the court filing, Lively claimed that Baldoni “leaned forward and slowly dragged his lips from her ear and down her neck as he said, ‘it smells so good’... When Ms. Lively later objected to this behavior, Mr. Baldoni’s response was, ‘I’m not even attracted to you.’”\nIn the video, Baldoni makes an awkward joke about his nose being “so big” after Lively calls attention to it. Lively also tells him, “I’m probably getting spray tan on you,” to which Baldoni replies, “It smells good.”\nIt certainly puts Lively's description of the scene in perspective.\nIs Blake Lively Using Her Friendship With Taylor Swift To Intimidate Justin Baldoni?\nMEGA\nAdvertisement\nAdvertisement\nAdvertisement\nAccording to Baldoni’s lawsuit, Lively implied that she would “change her mind” about asking Taylor Swift to use her song “My Tears Ricochet” in the movie trailer unless her demands were met. The demands, in this case, were editing rights to the film. In the filing, Baldoni included an alleged text exchange with a Sony executive, which read:\n\"Blake is calling Taylor to approve the song. She of course just reached out saying she is asking for time with [REDACTED] her editor. We know it was conditional on signing contract, but asking if you will reconsider so [REDACTED] can release this trailer and Blake does not change her mind re calling Taylor Swift.\"\nAnother alleged text message shows Baldoni and Lively addressing a script change that Lively wanted to make. The text messages address a meeting that took place at Lively’s penthouse, with both Reynolds and Swift present.\nBaldoni told her that he “really” loved the changes that she made and felt that they made the rooftop scene in question more “fun and interesting” but noted that he “would have felt that way without Ryan and Taylor.”\nLively then compared herself to a “Game of Thrones” character, allegedly responding:\nAdvertisement\nAdvertisement\n\"I happen to have a few dragons. For better or worse, but usually for better. Because my dragons also protect those I fight for. So really we all benefit from those gorgeous monsters of mine. [Smiley-face emoji] You will too, I can promise you.\"\nIt remains to be seen how Taylor Swift feels about being called a \"gorgeous monster.\" Conflicting reports have emerged about their friendship, but it’s worth noting that they haven’t been photographed together since October. Other reports have indicated that\nSwift was never even supposed to be at the meeting\n, but it just happened to be going on when Swift went to visit her friend.\nBlake Lively Allegedly Wanted Justin Baldoni To Take ‘Accountability’ For Bad Press\nMEGA\nLively’s attempt at promoting the film was met with memes for weeks after she treated the film like a traditional rom-com and encouraged fans to “Grab your girls, wear your florals” while heading to the theater. Maybe it’s a little on the nose to make a story about a girl named Lily who runs a flower shop, but fans online felt that it was inappropriate to reduce a movie about domestic violence to something more Barbie-like.\nAccording to Baldoni’s amended complaint on his website, Lively reached out to his production team and asked them to take the blame for the negative press that she received while promoting the film, which also included a\nresurfaced interview of her being rude to a reporter\n.\nAccording to Baldoni's court documents, Lively and Reynolds “demand[ed]” that their statement be released on Baldoni and his company’s behalf and that refusal to do so meant the \"gloves will come off.\" It's pretty clear that Baldoni's production team never released the statement, and the gloves have indeed come off.\nWill Justin Baldoni Be Able To Come Out On Top?\nMEGA\nSo when it comes to Justin Baldoni vs. Blake Lively, who will come out on top?\nAdvertisement\nAdvertisement\nKristin says, when it comes to the court of public opinion, Baldoni has the upper hand. He has been dropping his dirty laundry all over the Internet for everyone to see (including an\nawkward 2 AM voice memo\n) in an effort to vindicate himself from Lively's claims. He wants to make it clear that her allegations have no merit, and, judging by what's been exposed so far, it certainly makes Lively look like the aggressor.\nAt the same time, Lively is married to Ryan Reynolds and it's doubtful that her career - or his, for that matter - will be impacted by the lawsuit, which is currently not scheduled to begin until March 2026. Baldoni already scored a legal win on Monday when\na judge rejected Lively's request for a gag order\n, which means that even more evidence will probably surface in the coming weeks.\nIt might be difficult for Baldoni to pick up the pieces career-wise no matter which way his legal battle unfolds, but he may walk away from all of this proving that he did not harass Lively in the way she claimed, and for him, that vindication might be enough.\nAdvertisement\nAbout Our Ads\nSolve the daily Crossword\n38,858 people played the daily Crossword recently. Can you solve it faster than others?\n38,858 people played the daily Crossword recently. Can you solve it faster than others?\nCrossword\nPlay on Yahoo"
  },
  {
    "title": "Review and Opinion: Netflix's American Manhunt: The O.J. Simpson ...",
    "link": "https://harrowonline.org/2025/02/06/review-and-opinion-netflixs-american-manhunt-the-o-j-simpson-case-more-spectacle-than-substance/",
    "snippet": "Feb 6, 2025 ... The docuseries does a decent job highlighting how O.J.'s fame and charisma turned the courtroom into a battleground for public opinion, with his legal team ...",
    "content": "Home\nMore Reviews\nReview and Opinion: Netflix’s American Manhunt: The O.J. Simpson Case – More...\nMore Reviews\nReview and Opinion: Netflix’s American Manhunt: The O.J. Simpson Case – More Spectacle Than Substance\nFebruary 6, 2025 11:30\nBy\nJoanne D Silva\nFacebook\nTwitter\nPinterest\nWhatsApp\nO.J Simpson. Image: Charles LeBlanc\nI clicked play on Netflix’s American Manhunt: The O.J. Simpson Case, expecting a fresh take on one of the most infamous trials in history. After all, it’s shot straight into the UK’s top two most-watched shows. But four episodes later, I’m left wondering: What’s this series really trying to say? Because while it covers all the familiar beats—the slow Bronco chase, the courtroom drama, the media frenzy—it tiptoes around the one thing that should be front and centre: the tragedy of Nicole Brown Simpson.\nNow, let me be honest—this isn’t some fast-paced thriller that keeps you on the edge of your seat. It’s a four-episode deep dive into a case that’s older than half of Gen Z, and unless you’re a true crime junkie, an O.J. superfan, or someone really passionate about domestic violence justice, you might struggle to sit through it all in one go. But hey, if you like your documentaries long, slow, and sprinkled with courtroom chaos, this one’s for you.\nFrom football star to courtroom drama king, O.J. Simpson wasn’t just any defendant—he was a beloved sports star, a cultural icon. When he was charged with the murders of Nicole Brown Simpson and Ron Goldman, it wasn’t just a criminal trial; it became a spectacle. The docuseries does a decent job highlighting how O.J.’s fame and charisma turned the courtroom into a battleground for public opinion, with his legal team playing their cards to perfection. And while, yes, America needed to confront the corruption and prejudice within law enforcement, Nicole’s story often feels overshadowed by the larger media circus.\nADVERTISEMENT\nRace, the Trial, and the Infamous Glove\nOne of the most controversial aspects of the trial was how race played a central role. The documentary examines how racial tensions in the U.S. influenced public opinion, particularly with Detective Mark Fuhrman’s testimony, which cast doubt on the police investigation. The series effectively explores how this trial wasn’t just about one man—it became a symbol of deeper societal issues.\nAnd yes, they cover that glove. You know the one. “If it doesn’t fit, you must acquit.” Watching O.J. try it on is a surreal moment in legal history—one that played a major role in the trial’s outcome. But while the documentary revisits these moments, it often feels like it’s more interested in rehashing well-known aspects of the case rather than offering any fresh insight.\nADVERTISEMENT\nNicole Brown Simpson: The Story That Deserved More Focus\nOne moment in the series really stuck with me. Mike Gilbert, a former friend of O.J., recalls asking him about a tree outside Nicole’s house—apparently, O.J. felt protective over it because of Nicole. While that detail might seem insignificant, it speaks to the deeper, complicated emotions surrounding their relationship.\nThe documentary does eventually focus on Nicole’s experience, highlighting the years of abuse allegations she reported. It provides a glimpse into the fear and struggle she faced, but it doesn’t quite go deep enough. Domestic violence isn’t just about what happens behind closed doors—it’s about the systemic failures that allow it to continue. Nicole called the police multiple times, and yet, despite warnings and documented incidents, the cycle continued.\nBy the time the series fully shifts its focus to Nicole, it feels like an afterthought rather than the driving force of the narrative. This was an opportunity to make a powerful statement about domestic violence, but instead, it mostly sticks to retelling the events we already know.\nADVERTISEMENT\nO.J. Simpson After the Trial: The Vegas Incident\nAfter the 1995 trial, O.J. Simpson largely faded from the spotlight—until 2007, when he was arrested for armed robbery in Las Vegas. The documentary briefly covers this part of his life, showing how he attempted to recover memorabilia he claimed was stolen. This time, the justice system was far less forgiving. In 2008, he was sentenced to 33 years in prison, though he served nine before being released on parole.\nAnd then, in April 2024, O.J. passed away from cancer. The documentary doesn’t cover this, but it’s an undeniable part of the case’s legacy. With his death, a chapter in American legal history has closed—but the debates surrounding his trial and the impact on pop culture remain.\nFinal Thoughts: A Missed Opportunity\nAmerican Manhunt: The O.J. Simpson Case does attempt to centre Nicole’s story, particularly in the later episodes, but it never quite delivers the depth it could have. While the documentary is thorough in revisiting the trial, it doesn’t bring anything particularly new to the table.\nADVERTISEMENT\nIt’s heavy. It’s frustrating. And it’ll leave you questioning how this case became more about spectacle than justice. But hey, if nothing else, it’s a well-produced deep dive into one of the most bizarre moments in legal history.\nFor those interested in courtroom drama, media frenzies, and true crime, this might be worth the watch. But for anyone hoping for a fresh perspective or a deeper exploration of Nicole Brown Simpson’s life and the broader issue of domestic violence, this documentary might feel like a missed opportunity.\nVerdict:\nIf you’re into messy courtroom drama, media spectacles, and legal history, this one’s worth a watch. But if you’re looking for something truly insightful, fresh, or emotionally impactful, you might want to give it a miss.\nNever miss another news story, subscribe to Harrow Online for FREE!\nFull Name\nEmail\nI confirm that I'd like to receive news from Harrow Online. (Click for Privacy Policy.)\nTags\nMore Reviews\nNetflix\nReview\nTV\nTAGS\nMore Reviews\nNetflix\nReview\nTV\nFacebook\nTwitter\nPinterest\nWhatsApp"
  },
  {
    "title": "Anyone watching Wags to Riches on Netflix? : r/ReadyToLove",
    "link": "https://www.reddit.com/r/ReadyToLove/comments/1i9110y/anyone_watching_wags_to_riches_on_netflix/",
    "snippet": "Jan 24, 2025 ... The real estate agents must forget production is public. One of the do ... opinion with a grain of salt, but I was excited when I saw this on Netflix ...",
    "content": "It's about damn time!\n-Colormeslowly\nReady to Love TV show et al. @OWNTV\n\"Some people get into the streets.  We get into the mess!\"-Queen Mod\nOmg this show!!! I’d love to get everyone’s thoughts on it! I’ve literally been complaining about it for the last 30 mins to my poor bf 😅\nI absolutely hate how the women behave - so gossipy and bitchy. Sharelle is such a bully and all the sheep women follow her because they said and I quote “if you want to be a popular girl, you have to be friends with a popular girl”. Very high school.\nSo essentially if Sharelle hates someone, they also hate them just because they want to benefit from her network, business connections and money. Such a terrible example of how female friendships could be. It’s all about using people for what they possess and not for who the women are. Very shallow people in very shallow relationships. They are obsessed with how they look, how they are perceived and are slave to the money. They’ll do anything for it. Hate this about society sorry.\nWhy can’t we have a show we’re successful black women are uplifting each other. And also, why can’t t we platform self made women instead of wives of rich men. This is the same thing about Real Housewives aswell (with the exception of certain cast mates).\nAnyways these are my thoughts - ready to discuss with yall.\nCreate your account and connect with a world of communities.\nIt's about damn time!\n-Colormeslowly\nAnyone can view, post, and comment to this community"
  },
  {
    "title": "How Zero Day Shapes Public Perception Netflix's Zero Day, starring ...",
    "link": "https://www.instagram.com/theyarn__/p/DGUWEWChjV9/",
    "snippet": "1 day ago ... Netflix's Zero Day, starring Robert De Niro, explores government conspiracies and cyber warfare. While marketed as a thriller, it may serve a deeper agenda— ...",
    "content": ""
  },
  {
    "title": "Belle Gibson really pretended to have cancer. So why is Netflix's ...",
    "link": "https://www.theguardian.com/tv-and-radio/2025/feb/08/belle-gibson-apple-cider-vinegar-netflix-series-interview-creator-samantha-strauss-ntwnfb",
    "snippet": "Feb 7, 2025 ... ... Opinion · Sport · Culture · Lifestyle. Show more Hide ... Whether or not there's any legal blowback for Netflix, public sympathy for Gibson is likely to be scant.",
    "content": "Kaitlyn Dever as Belle Gibson in Apple Cider Vinegar, streaming now on Netflix.\nPhotograph: Ben King/AP\nView image in fullscreen\nKaitlyn Dever as Belle Gibson in Apple Cider Vinegar, streaming now on Netflix.\nPhotograph: Ben King/AP\nTelevision\nBelle Gibson really pretended to have cancer. So why is Netflix’s Apple Cider Vinegar only ‘true-ish’?\nApple Cider Vinegar is based on the case of the Australian fraudster – but even after the controversy over Baby Reindeer, it fictionalises parts of an already shocking story\nGet our weekend culture and lifestyle email\nKatie Cunningham\nFri 7 Feb 2025 14.00 GMT\nLast modified on Fri 7 Feb 2025 14.02 GMT\nShare\nThree minutes into its first episode, Apple Cider Vinegar breaks the fourth wall.\n“This is a true story based on a lie,” says Kaitlyn Dever, who plays Belle Gibson, to the camera. “Some names have been changed to protect the innocent. Belle Gibson has not been paid for the recreation of her story.”\nThen – as Gibson – she pauses, looks away, and mumbles under her breath: “Fuckers.”\nThis disclaimer is repeated at the start of most episodes of Netflix’s six-part limited series, which is based on the rise and fall of Gibson, a fraudster who built a massive business after faking brain cancer that was miraculously cured by a healthy diet. For creator and writer Samantha Strauss, such a disclaimer felt like an essential inclusion.\n“I was having a conversation with a friend whose partner had brain cancer, and they were horrified that I was doing the show – ‘Why would you want to give this woman any more oxygen? Are they being paid for it?’” she says. “I just thought, oh, that’s such an interesting, visceral reaction that is something that a lot of viewers are going to come at it [with] – it’s important to say right upfront that she’s not part of this; she’s not being paid.”\nIt’s not hard to understand why the idea of Gibson profiting from an adaptation of her story would rankle some. In the early 2010s, she amassed millions of Instagram followers with her inspirational account of how she’d beaten a terminal brain cancer diagnosis with healthy diet. She then launched a successful recipe app called The Whole Pantry, which was championed by Apple; published a cookbook with Penguin; and posted through it all, claiming she was donating much of her profits, then reportedly in excess of A$1m, to various charities.\nThe kicker, of course, was that Gibson never had cancer. Nor had she donated any significant amount of money –\njust $7,000 of the $300,000 she had claimed\n. It was all a spectacular con, one that enraged and captivated Australia – and had real world consequences for her followers who actually had cancer, and were encouraged to shirk conventional medicine in favour of alternative treatments.\nApple Cider Vinegar review – the wild wellness scammer who claimed she beat cancer with healthy living\nRead more\nNow, Apple Cider Vinegar is taking the tale of Belle Gibson to a global audience. Or, at least, a “true-ish” version of the story, as Netflix has carefully described it in their marketing of the show.\nNetflix’s telling of Gibson’s story is “inspired by” the book The Woman Who Fooled The World, written by journalists Beau Donelly and Nick Toscano, who first broke the story about Gibson’s empire of lies in 2015 and published their meticulously researched book about her two years later. Strauss optioned the book and Netflix greenlit the series in 2022.\nBoth Apple Cider Vinegar and Donnelly and Toscano’s book explore not just Gibson’s story, but the dawn of social media influencers, and the allure and false promises of “wellness”. They also explore the true toll of a cancer diagnosis, and how those who feel unheard or let down by conventional medicine end up scrambling for alternative options.\nThat wider angle was part of the appeal of the story for Strauss, who “didn’t want to do a story that was just the rise and fall of Belle”.\nView image in fullscreen\nSamantha Strauss at the Apple Cider Vinegar premiere in Sydney earlier this week.\nPhotograph: Hanna Lassen/Getty Images for Netflix\n‘This is a true story’ – or based on one?\nTelling the story of a real, living person is legally fraught, particularly in Australia, where defamation laws are strict. Apple Cider Vinegar comes hot on the heels of another Netflix show inspired by a true story: Baby Reindeer, about the life of Scottish comedian Richard Gadd and the woman he alleges stalked him.\nSign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning\nWhen Gadd’s show became a huge hit last year, internet sleuths swiftly uncovered and circulated the identity of Gadd’s real-life alleged stalker. That woman has now been given the green light to proceed with a US$170m defamation lawsuit against Netflix after\na judge ruled\nthe show was wrongly billed with “this is a true story” – rather than “based on a true story” – inviting viewers to take the story as fact when some elements were fictionalised.\nIn terms of Apple Cider Vinegar, a great deal of Donnelly and Toscano’s reporting is recreated faithfully: Gibson’s troubled childhood, her youth spent posting about invented maladies in online forums, and her ascent as an Instagram star. Many of the most unsettling details in the show are scenes taken from their book – like Gibson allegedly faking a seizure at her son’s fourth birthday; crashing a funeral she wasn’t invited to and crying with performative vigour; and the unsuccessful intervention staged by a friend, who tried to get Gibson to confess to her lies before the story broke publicly.\nView image in fullscreen\nAshley Zukerman as Gibson’s partner Clive in Apple Cider Vinegar.\nPhotograph: Courtesy Of Netflix\nDonnelly and Toscano are characters in the series, albeit not under their real names; and\nthe influencer Jessica Ainscough\n, who really did have cancer and spruiked alternative medicine as a treatment – with tragic consequences – appears to have inspired the character Milla Blake (played by Alycia Debnam-Carey): a social media darling with whom Gibson forms a parasocial relationship. (Like Milla, Ainscough was advised by doctors to amputate her arm, but chose instead to “treat” her cancer with coffee enemas and juicing.) And there was plenty from the public record to make use of, including Gibson’s infamous 60 Minutes interview, recreated word for word by a turtleneck-clad Dever.\nOther parts of the show take what Strauss describes as “creative licence” – including one scene where Gibson locks her young son in his room overnight while he’s sick, and another where she uses cocaine. Similarly, conversations between Gibson and her partner, and some of the other characters, are Strauss’s own inventions.\nskip past newsletter promotion\nSign up to\nSaved for Later\nFree newsletter\nCatch up on the fun stuff with Guardian Australia's culture and lifestyle rundown of pop culture, trends and tips\nEnter your email address\nSign up\nPrivacy Notice:\nNewsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our\nPrivacy Policy\n. We use Google reCaptcha to protect our website and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nafter newsletter promotion\n“I think we do really lean into it and say it honestly – this is true-\nish\n,” says Strauss, who admits she is feeling nervous about finally unveiling the project that has been seven years in development. The meta-ness of it all is not lost on her: “It’s an interesting thing when you’re dealing with someone who has lied and that you’re creating a work that is, in some respects, fiction as well.”\nView image in fullscreen\nAlycia Debnam-Carey as Milla and Aisha Dee as Chanelle in Apple Cider Vinegar.\nPhotograph: Ben King/Netflix/Courtesy Of Netflix\nStrauss says that no one involved with Apple Cider Vinegar has made contact with Gibson, and that their legal advice was that they “didn’t have to” speak to its controversial subject; she says the fallout from Baby Reindeer “has not been part of our conversations with Netflix at all”. Guardian Australia has attempted to contact Gibson for comment regarding her depiction in the show, but did not hear back.\nBut, as Strauss tells it, there are also artistic reasons to keep a distance from the real-life Gibson. “Not having contact with people does give you more licence to create,” she says.\nIf you’re going to spend seven years on a project, you have to get up every day and throw yourself at the wall\nSamantha Strauss\nStrauss talks about “my Belle” in explaining her imagining of a woman whose pathology and motivations have always remained elusive. The team spoke to psychologists in the course of their writing, but stopped short of diagnosing Gibson; in the show, she is painted as a longtime fantasist who feigns sickness as a shortcut to receiving attention, sympathy and much yearned-for love.\nApple Cider Vinegar touches on Gibson’s difficult childhood, drawn from Donnelly and Toscano’s book: Gibson claimed she left home at age 12, at one point living with a much older male colleague. How much to humanise its lead character was a delicate balancing act for Strauss.\n“I didn’t want to make the answer for my Belle just be ‘a bad childhood’. I wanted it to be more complicated than that,” says Strauss. “But I think that’s the whole game – finding empathy in the writing of it, but not crossing over the line … I never wanted to absolve her of what she did.”\nView image in fullscreen\nKaitlyn Dever as Belle in Apple Cider Vinegar.\nPhotograph: Courtesy Of Netflix\nApple Cider Vinegar never does absolve Gibson, who is by and large depicted as villainous. Whether or not there’s any legal blowback for Netflix, public sympathy for Gibson is likely to be scant. The former influencer was found to have engaged in misleading and deceptive conduct and fined $410,000 in 2017 – but nearly eight years later,\nher bill has grown to more than $500,000\nwith penalties and interest, and remains unpaid. The latest reports on Gibson have her claiming to be\n“adopted” into Melbourne’s Ethiopian community\n, calling herself Sabontu and speaking in broken English.\nGiven Gibson’s dubious morals and questionable actions – or perhaps despite them – Strauss says she wrestled with the decision to spotlight her story for Netflix’s global audience.\n“A lot. A huge amount, really,” she says. “I don’t want to do work that puts harm into the world … If you’re going to spend seven years on a project, you have to get up every day and throw yourself at the wall. It’s hard and it’s long, and it may not happen.\n“The only way to do that is, for me, is to feel like I’m doing something important or have something special to say. And it always felt like that.”\nApple Cider Vinegar is on Netflix now\nExplore more on these topics\nTelevision\nNetflix\nAustralian television\nCancer\nHealth\nfeatures\nShare\nReuse this content"
  }
]